Tekla.Structures.Dialog.MainWindow
The MainWindow class is a class for binding the .NET dialogs under the Tekla Structures main window.
This example shows how to use the Tekla.Structures.Dialog.MainWindow.AddExternalWindow(System.String,System.IntPtr) method to register a dialog
to be insensitive while certain Tekla Structures modal dialogs are open.
Unregistering is done similarly using the Tekla.Structures.Dialog.MainWindow.RemoveExternalWindow(System.String,System.IntPtr) method.
using System;
using Tekla.Structures.Dialog;
using Tekla.Structures.Model;
public partial class Form1 : FormBase
{
// Handles the form load event.
protected override void OnLoad(EventArgs e)
{
base.OnLoad(e);
MainWindow.Frame.AddExternalWindow(this.Name, this.Handle);
}
// Handles the form closed event.
protected override void OnClosed(EventArgs e)
{
MainWindow.Frame.RemoveExternalWindow(this.Name, this.Handle);
base.OnClosed(e);
}
}

Tekla.Structures.Dialog.MainWindow.Frame
The main Tekla Structures window.

Tekla.Structures.Dialog.MainWindow.#cctor
Creates a new main window instance.

Tekla.Structures.Dialog.MainWindow.Handle
Gets the handle.

Tekla.Structures.Dialog.MainWindow.AddExternalWindow(System.String,System.IntPtr)
Registers the entire dialog to be insensitive at certain
points, for example while modal Tekla Structures system dialog boxes
are open. When insensitive, the dialog does not respond to any input.
You can remove the registration of the dialog with Tekla.Structures.Dialog.MainWindow.RemoveExternalWindow(System.String,System.IntPtr).
Name: The unique name of the form.
Handle: The handle to the form that is to be added.

Tekla.Structures.Dialog.MainWindow.RemoveExternalWindow(System.String,System.IntPtr)
Removes a registration done with Tekla.Structures.Dialog.MainWindow.AddExternalWindow(System.String,System.IntPtr).
Name: The unique name of the form.
Handle: The handle to the form that is to be removed.